tests/fixtures/lis2/data/member_person_delete.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <imsx_syncRequestHeaderInfo xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.imsglobal.org/services/lis/mms2p0/wsdl11/sync/imsmms_v2p0">
      <imsx_version>V1.0</imsx_version>
      <imsx_messageIdentifier>2</imsx_messageIdentifier>
    </imsx_syncRequestHeaderInfo>
  </soapenv:Header>
  <soapenv:Body>
    <deleteMembershipRequest xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.imsglobal.org/services/lis/mms2p0/wsdl11/sync/imsmms_v2p0">
      <sourcedId>CM-editingteacher-CS10001.201740-1000001</sourcedId>
    </deleteMembershipRequest>
  </soapenv:Body>
</soapenv:Envelope>